# Create Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectShapeType..::..Create Method
DirectShapeType Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, String, ElementId) | Creates a DirectShapeType element. |
| Create(Document, String, ElementId, DirectShapeTypeOptions) | Creates a DirectShapeType element. |

# See Also
DirectShapeType Class
DirectShapeType Members
Autodesk.Revit.DB Namespace